export const ABOUT_DATA = [
  {
    id: 0,
    title: '💭 사용자 중심의 사고',
    content: [
      '다양한 사용 환경을 고려한 접근성 주심의 웹 구현을 지향합니다.',
      '보기 좋은 UI만이 아닌 반응형 웹, 키보드/스크린 리더 사용자 등 모두가 접근 가능한 UX도 고려합니다.',
    ],
  },
  {
    id: 1,
    title: '🔥 배움에 대한 열정',
    content: [
      '기술은 빠르게 변화하는 중 입니다.',
      '새로운 기술에 대한 호기심과 학습 태도를 키웁니다.',
      '모르면 무작정 찾아보는 것이 아닌 “왜?”라고 생각하며, 문제를 끝까지 해결합니다.',
    ],
  },
  {
    id: 2,
    title: '🗣️ 협업을 위한 소통',
    content: [
      '프론트엔드 개발자는 혼자 일하는 것이 아닌 다양한 분야의 사람들과 소통하며 일합니다.',
      '적극적인 소통을 통해 명확하게 나의 의견을 전달하고, 상대방의 피드백을 수용합니다.',
    ],
  },
  {
    id: 3,
    title: '🧹 깨끗한 코드와 꾸준한 리팩토링',
    content: [
      '코드 한 줄에도 의도와 목적을 고민하며 작성합니다.',
      '더 나은 구조와 성능을 위해 고민하고 리팩토링을 반복하며 끊임없이 고민합니다.',
    ],
  },
];
