export const EXPERIENCE_DATA = [
  {
    id: 0,
    title: '코딩 알려주는 누나 리액트 스터디 1기 수료',
    startDate: '2024. 03. 17',
    endDate: '2024. 04. 21',
    content: [''],
  },
  {
    id: 1,
    title: '멋쟁이사자처럼 프론트엔드 스쿨 10기 수료',
    startDate: '2024. 04. 22',
    endDate: '2024. 09. 25',
    content: [
      'Github를 활용한 버전 관리와 협업 방식, HTML/CSS를 이용한 웹 페이지 구조 설계 및 스타일링, 다양한 CSS 기법을 활용한 반응형 웹과 마크업 기반 클론 페이지 구현을 학습했습니다.',
      '또한 JavaScript의 기초부터 심화 문법, DOM 조작을 통한 동적 웹 페이지 개발, JavaScript 기반 클론 코딩을 수행하며 웹 동작 원리에 대한 이해를 높였습니다.',
      '이후 React를 활용한 컴포넌트 기반 개발, 상태관리 기법, 라우팅 등 실무 중심의 프론트엔드 개발 역량을 다졌으며, React로 실제 웹 애플리케이션을 제작하는 프로젝트를 진행했습니다.',
      '마지막으로 팀 프로젝트를 통해 기획·설계·개발·발표 전 과정을 경험하며 협업 능력과 실전 개발 역량을 강화했습니다.',
    ],
  },
  {
    id: 2,
    title: '주식회사 샤이닝라이언 (인턴)',
    startDate: '2025. 01.',
    endDate: '2024. 03',
    content: [
      '3명으로 구성된 프론트엔드 B2B 2팀으로 B2B 기업 복지 시장을 대상으로 한 반응형 랜딩 페이지를 기획부터 디자인, 개발, 배포까지 전담했습니다.',
      '초기 요구사항은 모바일 UI/UX 구현, TypeScript와 Next.js기반의 개발, Vercel을 통한 Serverless 배포, 슬랙 Web - hook 연동 등으로 구성되어 있었으며, 1~2주차에는 시장 조사 및 기능 구조 기획에 집중하였고, 3주차에는 갑작스럽게 Admin 페이지 리팩토링 요청이 있어 기존 코드와 디자인을 빠르게 분석한 후, 컴포넌트 구조를 개선하고 UI/UX를 전반적으로 향상해 가독성과 유지보수성을 높였습니다.',
      '최종 목표였던 B2B 반응형 랜더링 페이지는 디자인 시안이 제공되지 않았음에도 불구하고, 팀원들과 함께 직접 디자인을 기획하고 Figma를 활용해 페이지 UI를 제작했으며, 4주차에는 팀원들과 밤을 새워가며 페이지를 완성하고 상담 신청 시 슬랙 채널로 실시간 연동되는 기능까지 구현했습니다.',
      '결과적으로 디자인부터 기획, 개발, 협업, 일정 관리 전반을 주도적으로 수행했으며, 팀원 간의 유기적인 협업을 통해 최고의 팀워크 상을 받았습니다.',
    ],
  },
  {
    id: 3,
    title: '포토빛 사진관 (프리랜서)',
    startDate: '2025. 09. 04',
    endDate: '2025. 11. 14',
    content: [
      '프리랜서로 디지털 졸업 앨범 서비스 RIGRAM 프로젝트를 진행하며 기획부터 개발, 문서화까지 전 과정을 경험했습니다.',
      '프론트엔드 개발에서는 Next.js와 TypeScript를 기반으로 안정적인 컴포넌트 구조를 설계하고, SSR/CSR을 적절히 활용해 사용자 환경에 최적화된 페이지 렌더링을 구현했습니다.',
      '또한 Supabase를 활용해 인증, 데이터베이스 연동, 스토리지 관리 등 백엔드 기능을 직접 구축하며 전체 서비스의 흐름을 이해하고 운영 가능한 구조를 만들었습니다.',
      '프로젝트의 사용성을 높이기 위해 UI/UX 관점에서 화면 흐름을 재정리하고, 실제 사용자 기준으로 기능을 해석한 사용 설명서(Documentation)를 제작하여 누구나 쉽게 서비스 기능을 이해하고 활용할 수 있도록 문서 품질을 개선했습니다.',
      '이 과정에서 정보 구조화 능력과 사용자 관점의 커뮤니케이션 역량을 강화하였습니다.',
      '외주 프로젝트로 진행되며 기획자, 클라이언트와의 요구사항 조율, 기능 변경 대응, 일정 관리까지 직접 수행했습니다. 이를 통해 실제 서비스 개발 경험, 고객 커뮤니케이션 능력, 그리고 단독 프로젝트 운영 능력을 함께 다졌습니다.',
    ],
  },
];
